In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as  sns

In [5]:
df = pd.read_csv("Dataset/RS_Session_248_AS_9.csv", index_col="Sl. No.")
df.head()

,States/UTs,Schools with Girls' Toilet,Schools with functional Girls' Toilet
Sl. No.,,,
1,Andaman & Nicobar Islands,100.00,100.00
2,Andhra Pradesh,99.72,89.38
3,Arunachal Pradesh,95.60,94.62
4,Assam,97.24,94.72
5,Bihar,89.41,92.24

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 37 entries, 1 to 37
Data columns (total 3 columns):
 #   Column                                 Non-Null Count  Dtype
---  ------                                 --------------  -----
 0   States/UTs                             37 non-null     object
 1   Schools with Girls' Toilet             37 non-null     float64
 2   Schools with functional Girls' Toilet  37 non-null     float64
dtypes: float64(2), object(1)
memory usage: 1.2+ KB

In [7]:
df.describe()

       Schools with Girls' Toilet  Schools with functional Girls' Toilet
count                   37.000000                              37.000000
mean                    98.626216                              96.746757
std                      2.124541                               3.918441
min                     89.410000                              86.190000
25%                     98.070000                              94.720000
50%                     99.480000                              98.230000
75%                     99.980000                              99.980000
max                    100.000000                             100.000000

In [8]:
df["States/UTs"]

37

In [25]:
print(df[df["Schools with Girls\' Toilet"] == 100].count()[0])
print(df[df["Schools with Girls\' Toilet"] >= 99].count()[0])
print(df[df["Schools with Girls\' Toilet"] >= 98].count()[0])
print(df[df["Schools with Girls\' Toilet"] >= 97].count()[0])
print(df[df["Schools with Girls\' Toilet"] >= 95].count()[0])
print(df[df["Schools with Girls\' Toilet"] >= 94].count()[0])

9
25
28
31
35
36

In [27]:
df.loc[df["Schools with Girls\' Toilet"].idxmin()]

States/UTs                               Bihar
Schools with Girls' Toilet               89.41
Schools with functional Girls' Toilet    92.24
Name: 5, dtype: object